In [3]:
import pandas as pd

In [11]:
pd.read_excel(r'/Users/asfa/Desktop/Dataset1.xlsx')

      Name Class  Roll no   Address
0   Aditya    7A       34    Bokaro
1  Akansha    7B       23      Chas
2    Rohan    7C       12  Sector 5
3    krish    7D       25  sector 9

In [12]:
pd.read_csv(r'/Users/asfa/Desktop/Dataset2.csv')

      Name Class  Roll no   Address
0   Aditya    7A       34    Bokaro
1  Akansha    7B       23      Chas
2    Rohan    7C       12  Sector 5
3    krish    7D       25  sector 9
4     Alex    8D       43  sector 4
5  Prakash    8E       33  sector 3

In [18]:
pd.read_csv(r'/Users/asfa/Desktop/Dataset3.tsv',sep='\t')

  Name Class  Rollno
0  abc    6a      33
1  xyz    6b      44
2  pqr    8f      55

In [19]:
import os

In [20]:
os.getcwd()

'/Users/asfa'

In [21]:
pd.read_excel('Dataset1.xlsx')

      Name Class  Roll no   Address
0   Aditya    7A       34    Bokaro
1  Akansha    7B       23      Chas
2    Rohan    7C       12  Sector 5
3    krish    7D       25  sector 9